Repository: sacianc/faqplusmultilanguage
Catalog: Source/Microsoft.Teams.Apps.FAQPlusPlus/Properties/Strings.*.resx
Languages: es, pt

# AddQuestionSubtitle
source: Add new question details
es: Agregar nuevos detalles a la pregunta
pt: Incluir detalhes de nova pergunta

# AddToKBText
source: Add to knowledge base
es: Agregar a la base de conocimientos
pt: Incluir na Base de Conhecimento

# AnsweredTicketUserNotification
source: This request has been answered. Ask an expert again if you still need more assistance.
es: La solicitud fue respondida. Pregunte a un experto nuevamente si necesita más asistencia
pt: Sua solicitação foi respondida. Caso necessite auxilio adicional, faça nova consulta a um especialista.

# AnsweredUserNotificationStatus
source: Answered
es: Respondida
pt: Respondida.

# AnswerTitle
source: **Answer:**
es: **Respuesta:**
pt: **Resposta:**

# AppendActionMessage
source: AppendToKB
es: AdjuntarABaseConocimiento
pt: Adicionar a Base de Conhecimento

# AppendToKBText
source: Append this response with the existing answer in the knowledge base
es: Adjuntar esta respuesta a una respuesta existente en a base de conocimiento
pt: Acrescente esta resposta resposta a existente na base de conhecimento

# AskAnExpertButtonText
source: Ask expert
es: Preguntarle a un experto
pt: Consultar um Especialista

# AskAnExpertDisplayText
source: Ask expert
es: Preguntarle a un experto
pt: Consultar um Especialista

# AskAnExpertPlaceholderText
source: Type your detailed question and supporting details here (500 characters max)
es: Escriba su pregunta detallada y la solicitud de soporte aquí (500 caracteres máximo)
pt: Digite aqui detalhadamente a sua pergunta bem como as informações complementares (máximo 500 caracteres)

# AskAnExpertText2
source: ...If my answer isn't satisfactory... I'll connect you to an expert.
es: …Si mi respuesta no le satisface… Lo conectaré con un experto.
pt: … se minha resposta não é satisfatória… lhe connectaremos as um especialista.

# AskAnExpertTitleText
source: **Ask an expert**
es: **Preguntarle a un experto**
pt: **Consulte um especilista**

# BackButtonCommandText
source: BackButton
es: VolverBoton
pt: BotãodeRetorno

# BackButtonText
source: Back
es: Volver
pt: Retorno

# ChangeLanguageHeaderText
source: Choose your language
es: Elija su idioma
pt: Escolha o idioma preferido

# ChatTextButton
source: Chat with {0}
es: Conversar con {0}
pt: Interaja com {0}

# ChatWithExpertButton
source: Chat with expert
es: Chatear con el experto
pt: Converse com um especilista via chat

# CustomMessage
source: Seems like I don't have the answer in my database. I can loop you in with an expert to answer your question, Click on "Ask expert" for posting your question to the expert.
es: Parece ser que no tengo ninguna respuesta en mi base. Puedo conectarte con un experto para responder su pregunta. Haga click en "Preguntarle a un experto" para elevar dicha consulta
pt: Ao que parece que não tenho uma resposta no meu banco de dados. Posso coloca-lo em contato com um especialista para responder sua pergunta, clique em "Pergunte especialista" para postar sua pergunta ao especialista.

# CustomMessageHeader
source: **I don't have the answer to that!**
es: **No tengo una respuesta para eso**
pt: **Eu não conheço a resposta a esta questão!**

# DateCreatedDisplayFactTitle
source: **Created:**
es: Creado:
pt: **Criado em:**

# DateFactTitle
source: **Date:**
es: **Fecha:**
pt: **Data:**

# DateFormat
source: {0} at {1}
es: {0} a las {1}
pt: {0} as {1}

# DeleteButtonText
source: Delete
es: Eliminar
pt: Remover

# DeleteConfirmation
source: Are you sure you want to delete this item? The question and answer will both be deleted.
es: Está seguro que desea eliminar este mensaje? Tanto la pregunta como la respuesta serán eliminadas.
pt: Está certo de que deseja excluir esse item? Tanto a pergunta como a resposta associada serão apagadas.

# DeletedQnaPair
source: Deleted by {0}
es: Eliminado por [0]
pt: Excluido por {0}

# DescriptionFact
source: **Description:**
es: **Descripción:**
pt: **Descrição:**

# DescriptionLabelText
source: Detailed answer
es: Respuesta detallada
pt: Resposta detalhada

# DescriptionPlaceholderText
source: Type your answer here
es: Escriba su pregunta aquí:
pt: Digite sua pergunta aqui

# DescriptionText
source: **Description:**
es: **Descripción:**
pt: **Descrição:**

# EditButtonText
source: Edit
es: Editar
pt: Editar

# EditQuestionSubtitle
source: Edit question details
es: Editar detalles de la pregunta
pt: Editar detalhes da pergunta

# EmptyDescriptionErrorText
source: Description cannot be empty.
es: Descripción no puede quedar vacío
pt: Descrção não pode esatr em branco.

# EmptyQuestionErrorText
source: Question text cannot be empty.
es: Pregunta no puede quedar vacío.
pt: Texto da pergunta não pode estar em branco.

# EnglishButtonText
source: English
es: Ingles
pt: inglês

# EntryCreatedByText
source: Created by
es: Creado por
pt: Criado por

# ErrorMessage
source: Something went wrong. Please try again later.
es: Algo salió mal. Por favor intente nuevamente más tarde.
pt: Algo saiu errado. Por favor, tente novamente em alguns minutos.

# ExistingAnswerFactTitle
source: **Existing answer:**
es: **Respuesta existente:**
pt: **Resposta existente:**

# FeedbackDescriptionPlaceholderText
source: Would love to hear more about your feedback
es: Nos gustaría escuchar su opinión
pt: Gostariamos de ter mais detalhes sobre o seu comentário

# FeedbackRatingRequired
source: Was the answer helpful?
es: La respuesta fue de ayuda?
pt: A resposta foi útil?

# FeedbackText1
source: Tell my team of experts how I'm doing so they can help me improve.
es: Coméntele a mi equipo de expertos como lo esto haciendo para que ellos puedan ayudarme y mejorarme
pt: Diga à nossa equipe de especialistas como estou indo para que eles possam me ajudar a melhorar.

# FunctionCardText1
source: Ask a question
es: Hacer una pregunta
pt: Faça uma pergunta

# FunctionCardText2
source: You can ask me a question by typing it in the chat box below I'll try my best to answer it...
es: Puede realizarme preguntar escribiendo en el campo de conversación debajo. Intentaré buscar la mejor respuesta a ella.
pt: Você pode me fazer uma pergunta digitando na caixa de bate-papo abaixo eu vou me esforçar respondê-la...

# GoToOriginalThreadButtonText
source: Go to original thread
es: Ir a la conversación original
pt: Voltar a discussão anterior

# GoToThread
source: View details
es: Ver detalles
pt: Ver detalhes

# HelpfulRatingText
source: Helpful
es: De mucha ayuda
pt: Útil

# HTMLErrorText
source: HTML tags are not supported.
es: Tags de HTML no están soportados
pt: As tags HTML não são suportadas.

# ImageLabelText
source: Image URL (optional)
es: URL de la imagen (opcional)
pt: URL de imagem (opcional)

# ImageUrlPlaceholderText
source: Paste image url here
es: Pegue la url de la imagen aquí
pt: Colar url de imagem aqui

# LastEditedText
source: Last edited by
es: Ultima edición por
pt: Última edição por

# MandatoryAnswerFieldText
source: Answer field is mandatory.
es: El campo respuesta es mandatorio
pt: O campo de resposta é obrigatório.

# MandatoryTitleFieldText
source: Title field is mandatory.
es: El titulo es un campo mandatorio
pt: O campo de títulos é obrigatório

# ManuallyAddedQuestionMessage
source: Manually added question
es: Pregunta agregada manualmente
pt: Pergunta adicionada manualmente

# MyQuestionLabelText
source: My questions
es: Mis preguntas
pt: Minhas perguntas

# MyQuestionNotificationCardContent
source: You can check the questions answered by experts in "My questions" tab.
es: Puede chequear sus preguntas respondidas por expertos en la pestaña "Mis Preguntas"
pt: Você pode consultar as perguntas respondidas por especialistas na aba "Minhas perguntas".

# NeedsImprovementRatingText
source: Needs Improvement
es: Necesita mejora
pt: Requer melhorias

source: No
pt: Não

# NonSMEErrorText
source: The messaging extension can only be invoked from the channel in which the app is installed
es: Las extensiones de mensaje solo pueden ser invocadas desde el canal donde la app está instalada.
pt: A extensão de mensagens só pode ser chamada a partir do canal em que o aplicativo está instalado.

# NotHelpfulRatingText
source: Not helpful
es: De poca ayuda
pt: Não foi útil

# NotificationCardContent
source: **I have posted your question to experts**
es: **Envié su pregunta a los expertos**
pt: **Eu enviei sua pergunta aos especialistas**

# NotificationCardDetailContent
source: Your query has been shared with the experts, i'll get back to you with the updates.
es: Su consulta fue compartida con los expertos, volveré con usted cuando haya una actualización
pt: Sua consulta foi compartilhada com os especialistas, eu farei contato com você para atualizações.

# PreviewButtonText
source: Preview
es: Previsualizar
pt: Pré-visualizar

# PreviewCardHeaderMessage
source: Here is a preview of your knowledge base entry
es: Aquí hay una previzualización de su nueva entrada en la base de de conocimientos.
pt: Eis uma prévia da entrada na base de conhecimento

# ProvidedByFact
source: **Provided by:**
es: **Provisto por:**
pt: **Fornecido por:**

# QuestionAlreadyExistsErrorText
source: Question already exist. please add different question.
es: La pregunta ya existe, agregue una pregunta diferente
pt: A pergunta já existe na base. por favor, adicione uma pergunta diferente.

# QuestionAskedByFactTitle
source: **Asked by:**
es: **Preguntado por:**
pt: **Autor:**

# QuestionLabelText
source: Question
es: Pregunta
pt: Consulta

# QuestionMessageFeedbackText
source: **Question:**
es: **Pregunta:**
pt: **Consulta:**

# QuestionPlaceholderText
source: Type your question here (Max 300 characters)
es: Escriba su pregunta aquí (Maximo 300 caracteres)
pt: Digite aquiui sua consulta (Max 300 caracters)

# QuestionTitle
source: **Question:** {0}
es: **Pregunta:** {0}
pt: **Consulta:** {0}

# RatingMandatoryText
source: Rating is mandatory
es: Calificación es mandatorio
pt: A avaliação é requerida

# RatingTitle
source: **Rating:**
es: **Calificación**
pt: **Avaliação:**

# RespondButtonText
source: Respond
es: Responder
pt: Responder

# ResponsePlaceholderText
source: Write your response here
es: Escriba su respuesta aquí
pt: Escreva sua resposta aqui

# SaveButtonText
source: Save
es: Guardar
pt: Salvar

# SendFeedbackButtonText
source: Send feedback
es: Enviar Opinion
pt: Enviar comentários

# SendFeedbackDisplayText
source: Send feedback
es: Enviar Opinion
pt: Enviar comentários

# ShareFeedbackButtonText
source: Feedback
es: Comentarios
pt: Comentários

# ShareFeedbackDisplayText
source: Feedback
es: Comentarios
pt: Comentários

# ShareFeedbackTitleText
source: Share app feedback
es: Compartir opinión de la app
pt: Compartilhar comentário sobre a aplicação

# ShowCardTitleText
source: Enter short title here (50 characters max)
es: Ingrese un titulo corto aquí (50 caracteres máximo)
pt: Digite título curto (50 caracteres no máximo)

# SMEAnsweredResponseStatus
source: {0} has responded to the question, the question has been marked as answered.
es: {0} ha respondido a su pregunta, la pregunta fue marcada como respondida
pt: {0} respondeu à pergunta, esta foi marcada como respondida.

# SMEAnsweredUpdateStatus
source: {0} has responded and updated the answer in the knowledge base.
es: {0} ha respondido y actualizado la base de conocimientos
pt: {0} respondeu e atualizou a resposta na base de conhecimento.

# SMEFeedbackHeaderText
source: **Feedback received**
es: **Opinión recibida**
pt: **Comentários recebidos**

# SMEReplyCardAnswerByExpert
source: Answer by expert {0}
es: Respuesta por experto {0}
pt: Respondida pelo especialista {0}

# SMEReplyCardFooterMessage
source: I hope the answer was useful to you. Your query has been marked as answered, if you still need assistance regarding the question, feel free to chat with the expert.
es: Espero que la respuesta le haya sido de utilidad. Su respuesta fue marcada como respondida, si aun necesita asistencia en relación a su pregunta, sientase libre de chatear con el experto nuevamente
pt: Espero que a resposta tenha sido útil para você. Sua consulta foi marcada como respondida, se você ainda precisar de assistência em relação à pergunta, sinta-se livre para conversar com o especialista.

# SMEReplyCardHeaderText
source: **ID #{0} | Expert responded to your query**
es: **ID #{0} | Experto respondió su consulta**
pt: **ID #{0} | Especialista respondeu sua consulta**

# SMETicketActualQuestionInKBText
source: Actual question in KB: {0}
es: Pregunta actual en la basde de conocimiento: {0}
pt: Dúvida respondida na Base de Conhecimento: {0}

# SMETicketAnsweredAndUpdatedStatus
source: Answered and updated by {0}
es: Respondida y actualizada por {0}
pt: Respondida e atualizada por {0}

# SMETicketAnsweredStatus
source: Answered by {0}
es: Respondida por {0}
pt: Respondida por {0}

# SMETicketCardYourAnswerLabel
source: Your answer
es: Su respuesta
pt: Sua resposta

# SMETicketNoQuestionInKBText
source: No similar question found in knowledge base
es: No hay preguntas similares en la base de conocimientos
pt: Nenhuma pergunta semelhante encontrada na base de conhecimento

# SMETicketUnansweredStatus
source: Unanswered
es: Sin responder
pt: Não respondida

# SpanishButtonText
source: Español
pt: Espanhol

# SubmitResponseButtonText
source: Submit response
es: Enviar respuesta
pt: Enviar resposta

# SuggestedText
source: Text fields are markdown supported
pt: Os campos de texto suportam o uso de marcação

# TakeATeamTourButtonText
source: Team tour
pt: Tour da Equipe

# TakeATourButtonText
source: Take a tour
es: Hacer un tour
pt: Faça um tour

# TeamChatContent
source: Click chat with user button to initiate a direct chat.
es: Haga clic en el botón Conversar con el usuario para iniciar una conversación con él/ella
pt: Clique no botão "conversar com o usuário" para iniciar um bate-papo direto.

# TeamChatHeaderText
source: Initiate chat with end users
es: Iniciar conversación con el usuario
pt: Iniciar a conversa com usuários finais

# TeamCustomMessage
source: Hello, I don't support bot commands in the Team. Here is a quick tour of how I can help.
es: Hola, No soporto comandos de Bot en el equipo. Aquí tiene un pequeño tour de como puedo ayudar.
pt: Olá, eu não respodo comandos de bot na Equipe. A seguir uma rápida mostra de como eu posso ajudar.

# TeamNotificationContent
source: You can see what users need help with.
es: Usted puede ver con que tema el usuario necesita ayuda
pt: Você pode ver com o que os usuários precisam de ajuda.

# TeamNotificationHeaderText
source: Receive notifications from end users
es: Recibir notificaciones del usuario final
pt: Receber notificações de usuários finais

# TeamTicketSystemContent
source: Mark requests answered or unanswered to keep track of queries.
pt: Marque pedidos respondidos ou sem resposta para acompanhar as consultas.

# TeamTicketSystemHeaderText
source: Manage queries
es: Manejar consultas
pt: Gerenciar consultas

# ThankYouTextContent
source: Thanks a lot for the feedback!
es: Gracias por su opinión"
pt: Muito obrigado pelo comentário!

# TitleFact
source: **Title:**
es: **Titulo:**
pt: **Titulo:**

# TitleLabelText
source: Answer Title
es: Tiulo de la respuesta
pt: Título da Resposta

# TitlePlaceholderText
source: Type your title here
es: Escriba su titulo aquí
pt: Digite o seu título aqui

# TitleRequiredText
source: Title (Required)
es: Titulo (Requerido)
pt: Título (requerido)

# UnAnsweredUserNotificationStatus
source: Unanswered
es: Sin responder
pt: Sem resposta

# UpdateExistingButtonText
source: Update existing answer
es: Actualizar respuesta existente
pt: Atualizar resposta existente

# UpdateHistoryButtonText
source: Update history
es: Actualizar historial
pt: Atualizar histórico

# UpdateHistoryDateHeaderText
source: Date
es: Fecha
pt: Data

# UpdateHistoryHeadersText
source: Name|Action|Date
es: Nombre|Acción|Fecha
pt: Nome|Ação|Data

# ViewArticleButtonText
source: View answer
pt: Ver resposta

# WaitMessage
source: Please wait for some time, updates to this question: "{0}" will be available in short time.
es: Por favor espere un tiempo, actualización a esta pregunta: "{0}" estará disponible en breve
pt: Por favor, aguarde alguns instantes, atualizações para esta pergunta: "{0}" estarão disponíveis em alguns instantes.

# WaitMessageAnswer
source: Note: Updates are made every few minutes
es: Nota: Las actualizaciones se realizan cada ciertos minutos
pt: Nota: Atualizações ocorrem a intervalos regulrares

# WarningMessageOnUpdateAnswer
source: Your answer will be updated in the knowledge base as well as will be sent to the requester.
es: Su respuesta será actualizada en la base de conocimientos y enviada al solicitante
pt: Sua resposta será atualizada na base de conhecimento, bem como será enviada ao solicitante.

# WelcomeEnglishContent
source: Hi! I am FAQ bot, I can help you resolve your queries related to your learning about Teams platform. Please select a language in which you want to continue.
es: Hola! Soy FAQ bot, puedo ayudarte a responderte consultas asociadas a tu aprendizaje en la pltaforma de Teams. Por favor seleccione el idioma en el que quiere continuar.
pt: Oi! Eu sou o Faq bot, eu posso ajudá-lo esclarecendo suas dúvidas relacionadas ao seu aprendizado sobre a plataforma Teams. Por favor, selecione o idioma no qual deseja continuar.

# WelcomeHeaderText
source: Welcome!
es: Bienvenido!
pt: Bem-vindo!

# WelcomeTeamCardContent
source: Hello team, I am your friendly Q&A bot that helps you provide support to people who interact with me and need more assistance.
es: Hola equipo. Soy un Bot amigable de Preguntas y Respuesta que te ayuda a proveerle soporte a la gente con la que interactuó y necesita más asistencia.
pt: Olá equipe, Sou um robô amigável de Perguntas e Respostas que lhe apoiará para fornecer suporte às pessoas que interagem comigo e necessaitarem de assistência suplementar.

source: Yes
es: Si
pt: Sim

# DescriptionLabel
source: Description
es: Descripción

# InvalidImageUrlErrorText
source: Image URL is not valid.
es: La URL de la imagen no es válida

# StatusFactTitle
source: **Status:**
es: **Estado:**
